// Приклад 1: 'number' + 3 + 3
// Крок 1: 'number' + 3 → відбувається конкатенація (об'єднання) у рядок, отримуємо 'number3'
// Крок 2: 'number3' + 3 → знову конкатенація → 'number33'
console.log('number' + 3 + 3); // 'number33'

// Приклад 2: null + 3
// Крок 1: null перетворюється на число 0 при арифметичній операції
// Крок 2: 0 + 3 = 3
console.log(null + 3); // 3

// Приклад 3: 5 && "qwerty"
// Оператор && (і) повертає перший хибний елемент або останній, якщо всі істинні
// Оператор і в цьому випадку повертає останнє істинне значення
// Крок 1: 5 → truthy, йдемо до наступного операнда
// Крок 2: "qwerty" → truthy, повертаємо останній операнд
console.log(5 && "qwerty"); // "qwerty"

// Приклад 4: +'40' + +'2' + "hillel"
// Крок 1: +'40' → 40 унарний плюс перед стрінгою 40 перетворює стрінгу в число
// Крок 2: +'2' → 2 також перетворює стрінгу на число
// Крок 3: 40 + 2 = 42 арифметична операція складання
// Крок 4: 42 + "hillel" → "42hillel" конкатенація (об'єднання у рядок)
console.log(+'40' + +'2' + "hillel"); // "42hillel"

// Приклад 5: '10' - 5 === 6
// Крок 1: '10' - 5 → 10 - 5 = 5 Віднімання числа від рядка перетворює рядок в число
// Крок 2: 5 === 6 → false  потрійне = суворе порівняння, що враховує і значенні, і тип даних
console.log('10' - 5 === 6); // false

// Приклад 6: true + false
// Крок 1: в арифметичній операції true → число 1, false → число 0
// Крок 2: 1 + 0 = 1
console.log(true + false); // 1

// Приклад 7: '4px' - 3
// Віднімання числа від рядка перетворює рядок в число
// Крок 1: Але '4px' не можна перетворити на число → NaN
// Крок 2: NaN - 3 = NaN
console.log('4px' - 3); // NaN

// Приклад 8: '4' - 3
// Віднімання числа від рядка перетворює рядок в число
// Крок 1: '4' → 4
// Крок 2: 4 - 3 = 1
console.log('4' - 3); // 1

// Приклад 9: '6' + 3 ** 0
// ** оператор зведення у ступінь, має високий пріоритет
// Крок 1: возводимо 3 в нульову ступінь 3 ** 0 = 1 (будь-яке ненульове число, зведене в ступінь 0, дорівнює 1)
// Крок 2: '6' + 1 → конкатенація → '61'
console.log('6' + 3 ** 0); // '61'

// Приклад 10: 12 / '6'
// Ділення числа на рядок (що містить число) перетворює рядок на число
// Крок 1: '6' → 6
// Крок 2: 12 / 6 = 2 
console.log(12 / '6'); // 2

// Приклад 11: '10' + (5 === 6)
// за математичними правилами спочатку дія у дужках
// Крок 1: 5 === 6 → false (суворе порівняння, 5 не дорівнює 6)
// Крок 2: '10' + false → конкатенація → '10false'
console.log('10' + (5 === 6)); // '10false'

// Приклад 12: null == ''
// оператор нестрогої рівності == не перетворює null на числовий тип.
// істинним є тільки null == undefined → true, з усім іншим буде хибне, в тому числі з порожнім рядком
// Тому null == '' → false
console.log(null == ''); // false

// Приклад 13: 3 ** (9 / 3)
// Крок 1: за математичними правилами спочатку дія у дужках 9 / 3 = 3 
// Крок 2: возводимо 3 в ступінь 3. 3 ** 3 = 27
console.log(3 ** (9 / 3)); // 27

// Приклад 14: !!'false' == !!'true'
// !! перетворює будь-яке значення у boolean
// 'false' та 'true' - це рядки. Непусті рядки є "truthy"
// Крок 1: !!'false' → true (не порожній рядок, тому !!'false' → true.
// Крок 2: !!'true' → true
// Крок 3: true == true → true (== порівнює ці два однакових булевих значення)
console.log(!!'false' == !!'true'); // true

// Приклад 15: 0 || '0' && 1
// Операції "І" (&&) мають вищий пріоритет над операціями "АБО" (||)
// Крок 1: '0' && 1 → обидва truthy, повертає останнє істинне 1
// || повертає перший істинний операнд
// Крок 2: 0 || 1 → 1  0 - falsy, 1 - truthy
console.log(0 || '0' && 1); // 1

// Приклад 16: (+null == false) < 1
// Дія в дужках перша
// Крок 1: +null → 0  унарний плюс перед null перетворює значення null в числовий тип, повертаючи 0
// Крок 2: 0 == false → true  == не строге порівняння, тому 0 дорівнює false (false → 0)
// Крок 3: true < 1 → false При порівнянні булеве значення приводиться до числа: true → 1. 1 не менше 1
console.log((+null == false) < 1); // false 

// Приклад 17: false && true || true
// логічне І в пріорітеті
// Крок 1: false && true → false Оператор && повертає перший хибний елемент або останній, якщо всі істинні. Оскільки false – хибно, результат цієї частини – false
// Оператор АБО повертає перше істинне значення або останнє, якщо всі хибні. в цьому випадку повертає перше істинне — true.
// Крок 2: false || true → true (false або true повертає true)
console.log(false && true || true); // true

// Приклад 18: false && (false || true)
// Пріорітетною по математичним правилам стає дія в дужках
// Крок 1: false || true → true  (false або true - повертає перше істинне, тому це true)
// Крок 2: false && true → false (false і true - повертає перше хибне, тому це false)
console.log(false && (false || true)); // false

// Приклад 19: (+null == false) < 1 ** 5
// Дія в дужках, потім возведення в ступінь, потім вже порівняння
// Крок 1: +null → 0  унарний плюс перед null перетворює значення null в числовий тип, повертаючи 0
// Крок 2: 0 == false → true  == не строге порівняння, тому 0 дорівнює false (false → 0)
// Крок 3: 1 ** 5 = 1  (1 в ступені 5) Возведення в ступінь в пріорітеті
// Крок 4: true < 1 → false  (true має значення 1, а 1 не менше 1, тому false)
console.log((+null == false) < 1 ** 5); // false